<template>
  <div class="navBarV">
    <ul class="list">
      <li v-for="(item,index) in list"
      :key="index"
      class="listItem"
      @mouseover="showMoreInfo(index)"
      @mouseout="hideMoreInfo(index)"
      >
        <a v-for="(ach,index) in item.name" 
        class="anchor"
        :key="'ach' + index"
        >
          {{ach}}
        </a>
        <div class="moreInfo">
          <ul class="nav">
            <li v-for="(item2,index) in item.nav"
            :key="'nav'+ index"
            class="navItem">
              <a>{{item2}}</a>
            </li>
          </ul>
          <ul v-for="(item3,index) in item.type" 
            class="specList"
            :key="'spec' + index">
            <a class="specAnchor">{{item3.name}}</a>
            <div class="specItems">
              <li v-for="(item4,index) in item3.items"
              :key="'specc' + index"
              class="specItem">
                <a>{{item4}}</a>
              </li>
            </div>
            <hr>      
          </ul>
        </div>
      </li>
    </ul>
  </div>
</template>
<script>
export default {
  data () {
    return {
      list:[
        {
          "name":["家用电器"],
          "nav":["家电馆","乡镇专卖店",'家电服务','家电企业购','商用电器',"高端家电"],
          "type":[
              { 
                "name":"电视",
                "items":['曲面电视','超薄电视',"HDR电视","OLED电视","4K超清电视","人工智能电视",'55英寸',"65英寸",'电视配件']
              },
              {
                "name":"空调",
                "items":['壁挂式空调','柜式空调','中央空调',"节能空调","智能空调","变频空调","以旧换新","空调配件"]
              },
              {
                "name":"洗衣机",
                "items":["滚筒洗衣机",'洗烘一体机',"波纶洗衣机","迷你洗衣机","烘干机","洗衣机配件"]},
              {
                "name":"冰箱",
                "items":["多门","对开门","三门","双门",'冰柜/冰吧',"酒柜","冰箱配件"]},
              {
                "name":"厨卫大电",
                "items":["油烟机","燃气灶","烟灶套装","消毒柜","洗碗机","电热水器","燃气热水器","嵌入式厨电","商用厨房电器"]},
              {
                "name":"厨房小电",
                "items":[
                "电饭煲","微波炉","电烤箱","电磁炉",
                "电压力锅","空气炸锅","豆浆机","咖啡机",
                "面包机","榨汁机/原汁机","破壁机","料理机",
                "电饼铛","养生壶/煎药壶","酸奶机","煮蛋器",
                "面条机","电水壶/热水瓶","电炖锅","多用途锅",
                "电烧烤炉","电热饭盒","其它厨房电器",
                ]
              },
              {
                "name":"生活电器",
                "items":["取暖电器","吸尘器/除螨器","空气净化器","扫地机器人","加湿器","挂烫机/熨斗","电话机","插座","电风扇","冷风扇","净水器","饮水机","除湿机","干衣机","蒸汽拖把/拖地机","收录/音机","毛球修剪机","其他生活电器","生活电器配件",]},
              {
                "name":"个护健康",
                "items":["剃须刀","口腔护理","电吹风","美容器","洁面仪","卷/直发器","理发器","剃/脱毛器","足浴盆","健康秤/厨房秤","按摩器","足疗机","按摩椅","其他健康电器",]},
              {
                "name":"家庭影音",
                "items":["家庭影院","迷你影响","DVD","功效","回音壁","影音配件"]},
              {
                "name":"进口电器",
                "items":["进口电器"]},
                ],  
        },
        {
            "name":["手机/","运营商/","数码"],
            "nav":["玩3C","手机频道","网上营业厅","配件选购中心","企业购","以旧换新"],
            "type":[
                { 
                  "name":"手机通讯",
                  "items":["手机","对讲机","以旧换新","手机推荐"]
                },
                {
                  "name":"运营商",
                  "items":["合约机","选号码","固话宽带","办套餐","充话费/流量","中国电信","中国移动","中国联通","京东通信"]
                },
                {
                  "name":"手机配件",
                  "items":["手机壳","贴膜","手机储存卡","数据线","充电器","无线充电器","手机耳机","创意配件","手机饰品","手机电池","苹果周边","移动电源","蓝牙耳机","手机支架","车载配件","拍照配件"]},
                {
                  "name":"摄影摄像",
                  "items":["数码相机","单电/微单相机","单反相机","拍立得","运动相机","摄像机","镜头","户外器材","影棚器材","冲印服务","数码相框"]},
                {
                  "name":"数码配件",
                  "items":["储存卡","三脚架/云台","相机包","滤镜","闪光灯/手柄","相机清洁/贴膜","机身附件","镜头附件","读卡器","支架","电池/充电器"]},
                {
                  "name":"影音娱乐",
                  "items":[
                  "耳机/耳麦","音箱/音响","智能音箱","便携/无线音箱",
                  "收音机","麦克风","MP3/MP4","专业音频",
                  "智能手环","智能手表","智能眼镜","智能机器人",
                  "运动跟踪器","健康监测","智能配饰","智能配饰",
                  "智能家居","体感车","无人机","其他配件"
                  ]
                },
                {
                  "name":"电子教育",
                  "items":["学生平板","点读机/笔","早教益智","录音笔","电纸书","电子词典","复读机"]},
                {
                  "name":"个护健康",
                  "items":["剃须刀","口腔护理","电吹风","美容器","洁面仪","卷/直发器","理发器","剃/脱毛器","足浴盆","健康秤/厨房秤","按摩器","足疗机","按摩椅","其他健康电器"]
                },
              ]
        },
        {
          "name":["电脑/","办公/"],
          "nav":["玩3C","本周热卖","企业采购","GAME+","装机大师","私人定制"],
          "type":[
              { 
                "name":"电脑整机",
                "items":["笔记本","游戏本","平板电脑","平板电脑配件","台式机","一体机","服务器/工作站","笔记本配件"]
              },
              {
                "name":"电脑配件",
                "items":["显示器","CPU","主板","显卡",
                  "硬盘","内存","机箱","电源",
                  "散热器","刻录机/光驱","声卡/扩展卡","装机/配件",
                  "SSD固态硬盘","组装电脑"]
              },
              {
                "name":"外设产品",
                "items":["鼠标","键盘","键鼠套装","网络仪表仪器","U盘","移动硬盘","鼠标垫","摄像头","线缆","手写版","硬盘盒","电脑工具","电脑清洁","UPS电源","插座",]},
              {
                "name":"游戏设备",
                "items":["游戏机","游戏耳机","手柄/方向盘","游戏软件","游戏周边",]},
              {
                "name":"网络产品",
                "items":["路由器","网络机顶盒","交换机","网络储存","网卡","4G/3G上网","网络配件",]},
              {
                "name":"办公设备",
                "items":[
                "投影仪","投影设备","多功能一体机","打印机",
                "传真设备","验钞/点钞机","扫描设备","复合机",
                "碎纸机","考勤机","收银机","会议音频视频",
                "保险柜","装订/封装机","安防监控","办公家具",
                "白板",
                ]
              },
              {
                "name":"文具耗材",
                "items":["硒鼓/墨粉","墨盒","色带","纸类","办公文具",
                  "学生文具","文件管理","本册/便签","计算器","笔类",
                  "画具画材","财会用品","刻录碟片/附件"]},
              {
                "name":"服务产品",
                "items":["延保服务","上门安装","维修保养","电脑软件"]
              },
            ]
        },
        {
          "name":["家用电器"],
          "nav":["家电馆","乡镇专卖店",'家电服务','家电企业购','商用电器',"高端家电"],
          "type":[
              { 
                "name":"电视",
                "items":['曲面电视','超薄电视',"HDR电视","OLED电视","4K超清电视","人工智能电视",'55英寸',"65英寸",'电视配件']
              },
              {
                "name":"空调",
                "items":['壁挂式空调','柜式空调','中央空调',"节能空调","智能空调","变频空调","以旧换新","空调配件"]
              },
              {
                "name":"洗衣机",
                "items":["滚筒洗衣机",'洗烘一体机',"波纶洗衣机","迷你洗衣机","烘干机","洗衣机配件"]},
              {
                "name":"冰箱",
                "items":["多门","对开门","三门","双门",'冰柜/冰吧',"酒柜","冰箱配件"]},
              {
                "name":"厨卫大电",
                "items":["油烟机","燃气灶","烟灶套装","消毒柜","洗碗机","电热水器","燃气热水器","嵌入式厨电","商用厨房电器"]},
              {
                "name":"厨房小电",
                "items":[
                "电饭煲","微波炉","电烤箱","电磁炉",
                "电压力锅","空气炸锅","豆浆机","咖啡机",
                "面包机","榨汁机/原汁机","破壁机","料理机",
                "电饼铛","养生壶/煎药壶","酸奶机","煮蛋器",
                "面条机","电水壶/热水瓶","电炖锅","多用途锅",
                "电烧烤炉","电热饭盒","其它厨房电器",
                ]
              },
              {
                "name":"生活电器",
                "items":["取暖电器","吸尘器/除螨器","空气净化器","扫地机器人","加湿器","挂烫机/熨斗","电话机","插座","电风扇","冷风扇","净水器","饮水机","除湿机","干衣机","蒸汽拖把/拖地机","收录/音机","毛球修剪机","其他生活电器","生活电器配件",]},
              {
                "name":"个护健康",
                "items":["剃须刀","口腔护理","电吹风","美容器","洁面仪","卷/直发器","理发器","剃/脱毛器","足浴盆","健康秤/厨房秤","按摩器","足疗机","按摩椅","其他健康电器",]},
              {
                "name":"家庭影音",
                "items":["家庭影院","迷你影响","DVD","功效","回音壁","影音配件"]},
              {
                "name":"进口电器",
                "items":["进口电器"]},
                ],  
        },
        {
            "name":["手机/","运营商/","数码"],
            "nav":["玩3C","手机频道","网上营业厅","配件选购中心","企业购","以旧换新"],
            "type":[
                { 
                  "name":"手机通讯",
                  "items":["手机","对讲机","以旧换新","手机推荐"]
                },
                {
                  "name":"运营商",
                  "items":["合约机","选号码","固话宽带","办套餐","充话费/流量","中国电信","中国移动","中国联通","京东通信"]
                },
                {
                  "name":"手机配件",
                  "items":["手机壳","贴膜","手机储存卡","数据线","充电器","无线充电器","手机耳机","创意配件","手机饰品","手机电池","苹果周边","移动电源","蓝牙耳机","手机支架","车载配件","拍照配件"]},
                {
                  "name":"摄影摄像",
                  "items":["数码相机","单电/微单相机","单反相机","拍立得","运动相机","摄像机","镜头","户外器材","影棚器材","冲印服务","数码相框"]},
                {
                  "name":"数码配件",
                  "items":["储存卡","三脚架/云台","相机包","滤镜","闪光灯/手柄","相机清洁/贴膜","机身附件","镜头附件","读卡器","支架","电池/充电器"]},
                {
                  "name":"影音娱乐",
                  "items":[
                  "耳机/耳麦","音箱/音响","智能音箱","便携/无线音箱",
                  "收音机","麦克风","MP3/MP4","专业音频",
                  "智能手环","智能手表","智能眼镜","智能机器人",
                  "运动跟踪器","健康监测","智能配饰","智能配饰",
                  "智能家居","体感车","无人机","其他配件"
                  ]
                },
                {
                  "name":"电子教育",
                  "items":["学生平板","点读机/笔","早教益智","录音笔","电纸书","电子词典","复读机"]},
                {
                  "name":"个护健康",
                  "items":["剃须刀","口腔护理","电吹风","美容器","洁面仪","卷/直发器","理发器","剃/脱毛器","足浴盆","健康秤/厨房秤","按摩器","足疗机","按摩椅","其他健康电器"]
                },
              ]
        },
        {
          "name":["电脑/","办公/"],
          "nav":["玩3C","本周热卖","企业采购","GAME+","装机大师","私人定制"],
          "type":[
              { 
                "name":"电脑整机",
                "items":["笔记本","游戏本","平板电脑","平板电脑配件","台式机","一体机","服务器/工作站","笔记本配件"]
              },
              {
                "name":"电脑配件",
                "items":["显示器","CPU","主板","显卡",
                  "硬盘","内存","机箱","电源",
                  "散热器","刻录机/光驱","声卡/扩展卡","装机/配件",
                  "SSD固态硬盘","组装电脑"]
              },
              {
                "name":"外设产品",
                "items":["鼠标","键盘","键鼠套装","网络仪表仪器","U盘","移动硬盘","鼠标垫","摄像头","线缆","手写版","硬盘盒","电脑工具","电脑清洁","UPS电源","插座",]},
              {
                "name":"游戏设备",
                "items":["游戏机","游戏耳机","手柄/方向盘","游戏软件","游戏周边",]},
              {
                "name":"网络产品",
                "items":["路由器","网络机顶盒","交换机","网络储存","网卡","4G/3G上网","网络配件",]},
              {
                "name":"办公设备",
                "items":[
                "投影仪","投影设备","多功能一体机","打印机",
                "传真设备","验钞/点钞机","扫描设备","复合机",
                "碎纸机","考勤机","收银机","会议音频视频",
                "保险柜","装订/封装机","安防监控","办公家具",
                "白板",
                ]
              },
              {
                "name":"文具耗材",
                "items":["硒鼓/墨粉","墨盒","色带","纸类","办公文具",
                  "学生文具","文件管理","本册/便签","计算器","笔类",
                  "画具画材","财会用品","刻录碟片/附件"]},
              {
                "name":"服务产品",
                "items":["延保服务","上门安装","维修保养","电脑软件"]
              },
            ]
        },
        {
          "name":["家用电器"],
          "nav":["家电馆","乡镇专卖店",'家电服务','家电企业购','商用电器',"高端家电"],
          "type":[
              { 
                "name":"电视",
                "items":['曲面电视','超薄电视',"HDR电视","OLED电视","4K超清电视","人工智能电视",'55英寸',"65英寸",'电视配件']
              },
              {
                "name":"空调",
                "items":['壁挂式空调','柜式空调','中央空调',"节能空调","智能空调","变频空调","以旧换新","空调配件"]
              },
              {
                "name":"洗衣机",
                "items":["滚筒洗衣机",'洗烘一体机',"波纶洗衣机","迷你洗衣机","烘干机","洗衣机配件"]},
              {
                "name":"冰箱",
                "items":["多门","对开门","三门","双门",'冰柜/冰吧',"酒柜","冰箱配件"]},
              {
                "name":"厨卫大电",
                "items":["油烟机","燃气灶","烟灶套装","消毒柜","洗碗机","电热水器","燃气热水器","嵌入式厨电","商用厨房电器"]},
              {
                "name":"厨房小电",
                "items":[
                "电饭煲","微波炉","电烤箱","电磁炉",
                "电压力锅","空气炸锅","豆浆机","咖啡机",
                "面包机","榨汁机/原汁机","破壁机","料理机",
                "电饼铛","养生壶/煎药壶","酸奶机","煮蛋器",
                "面条机","电水壶/热水瓶","电炖锅","多用途锅",
                "电烧烤炉","电热饭盒","其它厨房电器",
                ]
              },
              {
                "name":"生活电器",
                "items":["取暖电器","吸尘器/除螨器","空气净化器","扫地机器人","加湿器","挂烫机/熨斗","电话机","插座","电风扇","冷风扇","净水器","饮水机","除湿机","干衣机","蒸汽拖把/拖地机","收录/音机","毛球修剪机","其他生活电器","生活电器配件",]},
              {
                "name":"个护健康",
                "items":["剃须刀","口腔护理","电吹风","美容器","洁面仪","卷/直发器","理发器","剃/脱毛器","足浴盆","健康秤/厨房秤","按摩器","足疗机","按摩椅","其他健康电器",]},
              {
                "name":"家庭影音",
                "items":["家庭影院","迷你影响","DVD","功效","回音壁","影音配件"]},
              {
                "name":"进口电器",
                "items":["进口电器"]},
                ],  
        },
        {
            "name":["手机/","运营商/","数码"],
            "nav":["玩3C","手机频道","网上营业厅","配件选购中心","企业购","以旧换新"],
            "type":[
                { 
                  "name":"手机通讯",
                  "items":["手机","对讲机","以旧换新","手机推荐"]
                },
                {
                  "name":"运营商",
                  "items":["合约机","选号码","固话宽带","办套餐","充话费/流量","中国电信","中国移动","中国联通","京东通信"]
                },
                {
                  "name":"手机配件",
                  "items":["手机壳","贴膜","手机储存卡","数据线","充电器","无线充电器","手机耳机","创意配件","手机饰品","手机电池","苹果周边","移动电源","蓝牙耳机","手机支架","车载配件","拍照配件"]},
                {
                  "name":"摄影摄像",
                  "items":["数码相机","单电/微单相机","单反相机","拍立得","运动相机","摄像机","镜头","户外器材","影棚器材","冲印服务","数码相框"]},
                {
                  "name":"数码配件",
                  "items":["储存卡","三脚架/云台","相机包","滤镜","闪光灯/手柄","相机清洁/贴膜","机身附件","镜头附件","读卡器","支架","电池/充电器"]},
                {
                  "name":"影音娱乐",
                  "items":[
                  "耳机/耳麦","音箱/音响","智能音箱","便携/无线音箱",
                  "收音机","麦克风","MP3/MP4","专业音频",
                  "智能手环","智能手表","智能眼镜","智能机器人",
                  "运动跟踪器","健康监测","智能配饰","智能配饰",
                  "智能家居","体感车","无人机","其他配件"
                  ]
                },
                {
                  "name":"电子教育",
                  "items":["学生平板","点读机/笔","早教益智","录音笔","电纸书","电子词典","复读机"]},
                {
                  "name":"个护健康",
                  "items":["剃须刀","口腔护理","电吹风","美容器","洁面仪","卷/直发器","理发器","剃/脱毛器","足浴盆","健康秤/厨房秤","按摩器","足疗机","按摩椅","其他健康电器"]
                },
              ]
        },
        {
          "name":["电脑/","办公/"],
          "nav":["玩3C","本周热卖","企业采购","GAME+","装机大师","私人定制"],
          "type":[
              { 
                "name":"电脑整机",
                "items":["笔记本","游戏本","平板电脑","平板电脑配件","台式机","一体机","服务器/工作站","笔记本配件"]
              },
              {
                "name":"电脑配件",
                "items":["显示器","CPU","主板","显卡",
                  "硬盘","内存","机箱","电源",
                  "散热器","刻录机/光驱","声卡/扩展卡","装机/配件",
                  "SSD固态硬盘","组装电脑"]
              },
              {
                "name":"外设产品",
                "items":["鼠标","键盘","键鼠套装","网络仪表仪器","U盘","移动硬盘","鼠标垫","摄像头","线缆","手写版","硬盘盒","电脑工具","电脑清洁","UPS电源","插座",]},
              {
                "name":"游戏设备",
                "items":["游戏机","游戏耳机","手柄/方向盘","游戏软件","游戏周边",]},
              {
                "name":"网络产品",
                "items":["路由器","网络机顶盒","交换机","网络储存","网卡","4G/3G上网","网络配件",]},
              {
                "name":"办公设备",
                "items":[
                "投影仪","投影设备","多功能一体机","打印机",
                "传真设备","验钞/点钞机","扫描设备","复合机",
                "碎纸机","考勤机","收银机","会议音频视频",
                "保险柜","装订/封装机","安防监控","办公家具",
                "白板",
                ]
              },
              {
                "name":"文具耗材",
                "items":["硒鼓/墨粉","墨盒","色带","纸类","办公文具",
                  "学生文具","文件管理","本册/便签","计算器","笔类",
                  "画具画材","财会用品","刻录碟片/附件"]},
              {
                "name":"服务产品",
                "items":["延保服务","上门安装","维修保养","电脑软件"]
              },
            ]
        },
      ],
    }
  },
  methods: {
    showMoreInfo (index) {
      var moreInfo = document.getElementsByClassName("moreInfo")[index]
      moreInfo.style.display = "block"
    },
    hideMoreInfo (index) {
      var moreInfo = document.getElementsByClassName("moreInfo")[index]
      moreInfo.style.display = "none"
    }
  }
  
}
</script>
<style lang="less" scoped>
  * {
    margin:0;
    padding:0;
  }
  a {
    text-decoration: none;
  }
  .navBarV {
    font-size:16px;
    position: relative;
    width:6vw;
    background:#eee;
    color:#000;
    .list {
      list-style:none;
      padding:0 auto;
      .listItem {
        margin-bottom:2px;
        .anchor {
          cursor:pointer;
          text-align:start;
          &:hover {
            color:red;
          }   
        }
        .moreInfo {
          display:none;
          position: absolute;
          z-index:1000;
          left:6vw;
          top:0;
          width:50vw;
          height:55vh;
          background:#fff;
          text-align:start;
          .nav {
            width:100%;
            margin-left:25px;
            .navItem {
              display:inline;
              font-size:1.2rem;
              width:5rem;
              height:2rem;
              line-height:2rem;
              color:#fff;
              margin:0 10px;
              padding:0 10px;
              background:#000;
              cursor: pointer;
              &:after{
                content:">";
                color:#fff;
              }
              &:hover {
                opacity:0.6;
              }
            }
          }
          .specList {
            width:100%;
            margin:10px 0;
            
            .specAnchor {
              font-size:1.5rem;
              font-weight:bold;
              width:10%;
              line-height:2.0rem;
              cursor:pointer;
              text-align:end;
              vertical-align: top;
              display:inline-block;
              &:after {
                content:">";
                vertical-align: top;
                color:#000;
                }
              &:hover {
                color:red;
                }
              }
            .specItems {
              display:relative;
              width:60%;
              display:inline-block;
              .specItem {
                display:inline;
                font-size:1.5rem;
                cursor: pointer;
                &:before {
                  content:"|";
                  color:#000;
                  border:2px solid transparent;
                  margin:0 5px;
                }
                &:hover {
                  color:red;
                }
              }
            }
            
          }

        }
      }
    }


  }


</style>
